-- MySQL dump 10.13  Distrib 8.0.21, for Win64 (x86_64)
--
-- Host: localhost    Database: foodinfomation
-- ------------------------------------------------------
-- Server version	8.0.21

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `food_infomation`
--

DROP TABLE IF EXISTS `food_infomation`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `food_infomation` (
  `id` int NOT NULL AUTO_INCREMENT,
  `food_name` varchar(50) NOT NULL,
  `protein` double(5,3) NOT NULL,
  `fat` double(5,3) NOT NULL,
  `carbohydrate` double(5,3) NOT NULL,
  `class_ification` varchar(10) NOT NULL,
  `remarks` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=100 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `food_infomation`
--

LOCK TABLES `food_infomation` WRITE;
/*!40000 ALTER TABLE `food_infomation` DISABLE KEYS */;
INSERT INTO `food_infomation` VALUES (1,'ササミ',0.230,0.008,0.000,'M','1本約43g'),(2,'皮なし鶏胸肉',0.223,0.015,0.000,'M','1枚約240g'),(3,'鶏胸肉皮なし',0.223,0.015,0.000,'M','1枚約240g'),(4,'鶏胸肉',0.195,0.116,0.000,'M','1枚約300g'),(5,'鶏モモ肉',0.162,0.140,0.000,'M',NULL),(6,'レバー',0.189,0.031,0.006,'M',NULL),(7,'鶏皮',0.095,0.486,0.000,'M',NULL),(8,'砂肝',0.183,0.018,0.000,'M',NULL),(9,'牛肉',0.144,0.329,0.002,'M',NULL),(10,'牛筋',0.283,0.049,0.000,'M',NULL),(11,'豚肉',0.142,0.346,0.001,'M',NULL),(12,'チャーシュー',0.149,0.082,0.051,'M',NULL),(13,'角煮',0.075,0.177,0.063,'M',NULL),(14,'卵',0.123,0.103,0.003,'M','1個約60g'),(15,'ウズラの卵',0.126,0.131,0.003,'M','1個約13g'),(16,'卵黄',0.165,0.335,0.001,'M','約17g'),(17,'卵白',0.105,0.000,0.004,'M','約38g'),(18,'牛乳',0.033,0.038,0.048,'M',NULL),(19,'低脂肪乳',0.038,0.010,0.055,'M',NULL),(20,'コーヒー牛乳',0.022,0.020,0.072,'M',NULL),(21,'フルーツ牛乳',0.012,0.002,0.099,'M',NULL),(22,'カマンベールチーズ',0.191,0.247,0.009,'M',NULL),(23,'クリームチーズ',0.082,0.330,0.023,'M',NULL),(24,'チェダーチーズ',0.257,0.338,0.014,'M',NULL),(25,'マヨネーズ',0.015,0.753,0.045,'M',NULL),(26,'バター',0.006,0.810,0.002,'M',NULL),(27,'無塩バター',0.005,0.830,0.002,'M',NULL),(28,'マーガリン',0.004,0.816,0.012,'M',NULL),(29,'ヨーグルト',0.036,0.030,0.049,'M',NULL),(30,'キュウリ',0.010,0.001,0.030,'V','1本約98g'),(31,'アスパラガス',0.026,0.001,0.046,'V','1本(太)約24g'),(32,'オクラ',0.021,0.001,0.076,'V','1本約9g'),(33,'カボチャ',0.019,0.001,0.133,'V','1/4カット約263g'),(34,'ブロッコリー',0.035,0.004,0.043,'V','1個約125g'),(35,'カリフラワー',0.027,0.001,0.051,'V','1個約400g'),(36,'キャベツ',0.013,0.002,0.052,'V','1/4カット約255g'),(37,'小松菜',0.016,0.001,0.030,'V','1束約255g'),(38,'春菊',0.027,0.005,0.045,'V','1束約198g'),(39,'生姜',0.009,0.003,0.066,'V','親指大約24g'),(40,'セロリ',0.004,0.001,0.036,'V','親指大約24g'),(41,'タケノコ',0.035,0.002,0.055,'V','1本約400g'),(42,'タマネギ',0.010,0.001,0.088,'V','1個約177g'),(43,'チンゲン菜',0.009,0.001,0.024,'V','1株約85g'),(44,'トウモロコシ',0.035,0.017,0.186,'V','1本(粒のみ)約150g'),(45,'トマト',0.007,0.001,0.047,'V','1個約165g'),(46,'ミニトマト',0.011,0.001,0.072,'V','1個約10g'),(47,'ナス',0.011,0.001,0.051,'V','1個約72g'),(48,'ニラ',0.026,0.005,0.057,'V','1束約100g'),(49,'ニンニク',0.064,0.009,0.275,'V','1カケ約6g'),(50,'白菜',0.008,0.001,0.032,'V','1個約940g'),(51,'レタス',0.006,0.001,0.028,'V','1個約490g'),(52,'ピーマン',0.009,0.002,0.051,'V','1個約26g'),(53,'ほうれん草',0.026,0.005,0.040,'V','1束約270g'),(54,'サツマイモ',0.014,0.002,0.390,'V','1個約200g'),(55,'里芋',0.015,0.001,0.134,'V','1個約40g'),(56,'ジャガイモ',0.015,0.001,0.197,'V','1個約135g'),(57,'山芋',0.022,0.003,0.139,'V','1本約670g'),(58,'長芋',0.022,0.003,0.139,'V','1本約670g'),(59,'株',0.006,0.001,0.050,'V','1株約340g'),(60,'ゴボウ',0.015,0.002,0.137,'V','1本約180g'),(61,'ダイコン',0.004,0.001,0.041,'V','1本約900g'),(62,'レンコン',0.013,0.001,0.161,'V','1節約240g'),(63,'ニンジン',0.008,0.001,0.087,'V','1本約146g'),(64,'インゲン',0.018,0.002,0.055,'V','1パック150g'),(65,'枝豆',0.015,0.061,0.089,'V',NULL),(66,'サヤエンドウ',0.032,0.002,0.070,'V','1個約2g'),(67,'そら豆',0.105,0.002,0.169,'V',NULL),(68,'モヤシ',0.016,0.000,0.023,'V','1袋200g'),(69,'エノキ',0.028,0.001,0.078,'V','1パック85g'),(70,'シイタケ',0.025,0.004,0.051,'V','1個約12g'),(71,'ブナシメジ',0.033,0.003,0.065,'V','1パック90g'),(72,'マイタケ',0.016,0.005,0.064,'V','1パック90g'),(73,'マッシュルーム',0.038,0.002,0.037,'V','1個約10g'),(74,'エリンギ',0.028,0.004,0.060,'V','1本約50g'),(75,'ナメコ',0.016,0.001,0.051,'V','1袋100g'),(76,'米',0.061,0.009,0.771,'C','1合150g'),(77,'玄米',0.028,0.010,0.356,'C','1合150g'),(78,'赤飯',0.039,0.004,0.424,'C',NULL),(79,'モチ',0.042,0.008,0.503,'C',NULL),(80,'パン',0.094,0.013,0.575,'C',NULL),(81,'ナン',0.103,0.034,0.476,'C',NULL),(82,'うどん',0.026,0.004,0.216,'C','1玉150g'),(83,'そうめん',0.035,0.004,0.258,'C','1束100g'),(84,'スパゲッティ',0.052,0.009,0.028,'C','1食100g'),(85,'そば',0.048,0.007,0.221,'C','1食150'),(86,'ラーメン',0.027,0.011,0.096,'C','1杯約760g'),(87,'醤油ラーメン',0.027,0.011,0.096,'C','1杯約760g'),(88,'味噌ラーメン',0.027,0.019,0.106,'C','1杯約760g'),(89,'塩ラーメン',0.026,0.012,0.094,'C','1杯約760g'),(90,'五目ラーメン',0.028,0.026,0.093,'C','1杯約880g'),(91,'落花生',0.254,0.475,0.188,'C','10粒約9g'),(92,'ピーナッツ',0.254,0.475,0.188,'C','10粒約9g'),(93,'クルミ',0.146,0.688,0.117,'C','1個約4g'),(94,'アーモンド',0.192,0.536,0.223,'C','10粒約12g'),(95,'カシューナッツ',0.198,0.476,0.267,'C','10粒約14g'),(96,'マカダミアナッツ',0.083,0.767,0.122,'C','1個約2g'),(97,'オリーブオイル',0.000,1.000,0.000,'C','大さじ約12g'),(98,'サラダ油',0.000,1.000,0.000,'C','大さじ約12g'),(99,'ごま油',0.000,1.000,0.000,'C','大さじ約12g');
/*!40000 ALTER TABLE `food_infomation` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-12-19 10:07:17
